#+STARTUP: folded indent inlineimages latexpreview

** インストールされた Dotnet Core の確認

- デフォルトのバージョン
#+begin_src sh
dotnet --version
#+end_src

#+RESULTS:
: 3.1.201

- すべてのバージョン
#+begin_src sh :results output
dotnet --list-sdks
#+end_src

#+RESULTS:
: 2.2.402 [/usr/share/dotnet/sdk]
: 3.1.201 [/usr/share/dotnet/sdk]

- すべてのランタイム
#+begin_src sh :results output
dotnet --list-runtimes
#+end_src

#+RESULTS:
: Microsoft.AspNetCore.All 2.2.8 [/usr/share/dotnet/shared/Microsoft.AspNetCore.All]
: Microsoft.AspNetCore.App 2.2.8 [/usr/share/dotnet/shared/Microsoft.AspNetCore.App]
: Microsoft.AspNetCore.App 3.1.3 [/usr/share/dotnet/shared/Microsoft.AspNetCore.App]
: Microsoft.NETCore.App 2.2.8 [/usr/share/dotnet/shared/Microsoft.NETCore.App]
: Microsoft.NETCore.App 3.1.3 [/usr/share/dotnet/shared/Microsoft.NETCore.App]

** 実行

- dotnet run
#+begin_src shell
dotnet run # project のあるフォルダで
dotnet run --project /path/to/hoge.csproj
#+end_src

#+begin_src sh
cd ~/Dropbox/repos/private/DotnetTest
dotnet run
#+end_src

#+RESULTS:
: Hello World!

- run コマンドで restore/build/run が実行される
  - restore 必要なライブラリのダウンロードと配置
  - build ビルドし dll を作成
  - run プログラムを実行 *商用環境では推奨されない*

- dotnet コマンドの引数に dll を指定すれば、ビルド済みのバイナリを実行可能
#+begin_src sh
cd ~/Dropbox/repos/private/DotnetTest/bin/Debug/netcoreapp2.2
dotnet DotnetTest.dll
#+end_src

#+RESULTS:
: Hello World!

** dotnet-script

- インストール (-g = Global)
dotnet tool install -g dotnet-script

#+begin_src sh
dotnet tool list -g
#+end_src

#+RESULTS:
| Package                               | Id | Version | Commands |
| ------------------------------------- |    |         |          |

- インストールスクリプト
curl -s https://raw.githubusercontent.com/filipw/dotnet-script/master/install/install.sh | bash
